#+TITLE: Config
*** Mixed pitch mode
Enable mixed-pitch-mode where it makes sense (LaTeX and org-mode).
We add the following fixed-faces:
- In latex, commands do not have a specific face. To set commands to fixed-pitch, instead we add rainbow-delimiters to ~mixed-pitch-fixed-pitch-faces~.
- Org-habit blocks
- Org-scheduled, to fix org-habit graph alignment somewhat
#+begin_src elisp
(use-package! mixed-pitch
  :config
  (set-face-attribute 'default nil :weight 'book)
  ;; This breaks font scaling. But otherwise changing fixed-pitch height doesn't work
  (setq mixed-pitch-set-height 't)
  (pushnew! mixed-pitch-fixed-pitch-faces
            ;; Fix for LaTeX where delimiters do not have a face equal to command
            'rainbow-delimiters-base-face
            'rainbow-delimiters-depth-1-face
            'rainbow-delimiters-depth-2-face
            'rainbow-delimiters-depth-3-face
            'rainbow-delimiters-depth-4-face
            'rainbow-delimiters-depth-5-face
            'rainbow-delimiters-depth-6-face
            'rainbow-delimiters-depth-7-face
            'rainbow-delimiters-depth-8-face
            'rainbow-delimiters-depth-9-face
            ;; Faces for org-habit graph
            'org-habit-alert-face
            'org-habit-alert-future-face
            'org-habit-clear-face
            'org-habit-clear-future-face
            'org-habit-overdue-face
            'org-habit-overdue-future-face
            'org-habit-ready-face
            'org-habit-ready-future-face
            ;; Fix alignment of org-habit graphs by ignoring scheduled face
            'org-scheduled
            'org-scheduled-previously
            'org-scheduled-today
            ;; Copied from doom
            'org-date
            'org-footnote
            'org-special-keyword
            'org-property-value
            'org-ref-cite-face
            'org-tag
            'org-todo-keyword-todo
            'org-todo-keyword-habt
            'org-todo-keyword-done
            'org-todo-keyword-wait
            'org-todo-keyword-kill
            'org-todo-keyword-outd
            'org-todo
            'org-done
            'font-lock-comment-face)
  :hook ((org-mode . mixed-pitch-mode)
         (TeX-mode . mixed-pitch-mode)
         (LaTeX-mode . mixed-pitch-mode)
         (org-roam-mode . mixed-pitch-mode)
         (slack-mode . mixed-pitch-mode)
         (lui-mode . mixed-pitch-mode)
         (Info-mode . mixed-pitch-mode)
         (helpful-mode . mixed-pitch-mode)
         (markdown-mode . mixed-pitch-mode)
         (gfm-mode . mixed-pitch-mode)))
#+end_src

#+RESULTS:
| +lookup--init-gfm-mode-handlers-h | mixed-pitch-mode |

